# Домашнее задание 2 (5 баллов).

Все задания ниже имеют равный вес (5/16).

In [18]:
import pandas as pd

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [19]:
import os
c = pd.DataFrame() 
for i in range(10):
    info = pd.read_csv(r'Students_info_' + str(i) + '.csv')
    marks = pd.read_csv(r'Students_marks_' + str(i) + '.csv')
    marks = marks.drop(['index'], axis = 1)
    c = pd.concat([c, info.join(marks)])
c.head(4)

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,1,female,group C,some college,standard,completed,group1,69,90,88
2,2,female,group B,master's degree,standard,none,group1,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,group1,47,57,44

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [20]:
c = c.drop(['index'], axis = 1)
c.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 3. Выведите на экран размеры полученной таблицы

In [21]:
c.shape

(1000, 9)

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [22]:
c.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [23]:
c.isna().sum().sum()

0

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [24]:
c.mean()

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [25]:
m, n = c[c['test preparation course'] == 'completed'], c[c['test preparation course'] == 'none']
print('comleted:\n', m.mean(), '\nnone:\n', n.mean())

comleted:
 math score       69.695531
reading score    73.893855
writing score    74.418994
dtype: float64
none:
 math score       64.077882
reading score    66.534268
writing score    64.504673
dtype: float64

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [26]:
df = c['lunch' ]
df = df.value_counts()
for i in df.index:
    print(i)

standard
free/reduced

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [27]:
c = c.rename(columns={'parental level of education' : 'education', 'test preparation course' : 'test preparation'})
c.head(3)

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93

**Зафиксируем минимальный балл для сдачи экзамена**

In [28]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark >= 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [29]:
passm = c[c['math score'] >= 50].shape[0]/c.shape[0]
passmc = c[(c['test preparation'] == 'completed') & (c['math score'] >= 50)].shape[0]/c.shape[0]
passmnf = c[(c['test preparation'] == 'none') & (c['math score'] >= 50) & (c['gender'] == 'female')].shape[0]/c.shape[0]
print(passm, '\n', passmc, '\n', passmnf)

0.865
 0.33
 0.264

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [30]:
%%time
a = c.groupby(['race/ethnicity']).mean()
print(a)

                math score  reading score  writing score
race/ethnicity
group A          61.629213      64.674157      62.674157
group B          63.452632      67.352632      65.600000
group C          64.463950      69.103448      67.827586
group D          67.362595      70.030534      70.145038
group E          73.821429      73.028571      71.407143
Wall time: 8.04 ms

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [31]:
%%time
b = c[c['race/ethnicity'] == 'group A']
b.mean()

Wall time: 0 ns

math score       61.629213
reading score    64.674157
writing score    62.674157
dtype: float64

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [32]:
import numpy as np
pd.pivot_table(c, values=['math score','reading score','writing score'], index=['education'],
                    columns=['gender'], aggfunc=np.mean)

                   math score            reading score             \
gender                 female       male        female       male
education
associate's degree  65.250000  70.764151     74.120690  67.433962
bachelor's degree   68.349206  70.581818     77.285714  68.090909
high school         59.351064  64.705882     68.202128  61.480392
master's degree     66.500000  74.826087     76.805556  73.130435
some college        65.406780  69.009259     73.550847  64.990741
some high school    59.296703  67.840909     69.109890  64.693182

                   writing score
gender                    female       male
education
associate's degree     74.000000  65.405660
bachelor's degree      78.380952  67.654545
high school            66.691489  58.539216
master's degree        77.638889  72.608696
some college           74.050847  63.148148
some high school       68.285714  61.375000

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [36]:
c['Math_PassStatus'] =  np.where(c['math score'] >= passmark, 'P', 'F')
c['Read_PassStatus'] = np.where(c['reading score'] >= passmark, 'P', 'F')
c['Write_PassStatus'] = np.where(c['writing score'] >= passmark, 'P', 'F')
c.head(4)

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,Math_PassStatus,Read_PassStatus,Write_PassStatus
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,P,P,P
1,female,group C,some college,standard,completed,group1,69,90,88,P,P,P
2,female,group B,master's degree,standard,none,group1,90,95,93,P,P,P
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F,P,F

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [49]:
c['OverAll_PassStatus'] =  np.where(((c['Math_PassStatus'] == 'F') |
                                     (c['Read_PassStatus'] == 'F') | (c['Write_PassStatus'] == 'F')), 'F', 'P')
c.head(3)

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,Math_PassStatus,Read_PassStatus,Write_PassStatus,OverAll_PassStatus
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,P,P,P,P
1,female,group C,some college,standard,completed,group1,69,90,88,P,P,P,P
2,female,group B,master's degree,standard,none,group1,90,95,93,P,P,P,P

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####    больше 90 = A
####      80-90 = B
####      70-80 = C
####      60-70 = D
####      50-60 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

**В случае, если средний балл попадает на границу между оценками (т.е. равен ровно 60, 70 или 80 баллов), вы можете интерпретировать условие на своё усмотрение (т.е. можете поставить за 60 баллов оценку D, а можете - E).**

In [90]:
def GetGrade(average_mark1):
    p = []
    for average_mark in average_mark1:
        if (average_mark < 50): 
            p.append('F')
            continue
        if (average_mark < 60): 
            p.append('E')
            continue
        if (average_mark < 70): 
            p.append('D')
            continue
        if (average_mark < 80): 
            p.append('C')
            continue
        if (average_mark < 90): 
            p.append('B')
            continue
        else: p.append('A')
    return p      
df = (c['math score'] + c['reading score'] + c['writing score'])/3          
c['Grade'] = GetGrade(df)
c.head(5)

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,Math_PassStatus,Read_PassStatus,Write_PassStatus,OverAll_PassStatus,Grade
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,P,P,P,P,C
1,female,group C,some college,standard,completed,group1,69,90,88,P,P,P,P,B
2,female,group B,master's degree,standard,none,group1,90,95,93,P,P,P,P,A
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F,P,F,F,F
4,male,group C,some college,standard,none,group1,76,78,75,P,P,P,P,C

In [91]:
c['Grade'].value_counts()

C    261
D    256
E    182
B    146
F    103
A     52
Name: Grade, dtype: int64